docs : update architecture graph
